# Dockerfile (ریشه اصلی پروژه)

# مرحله ۱: استفاده از یک ایمیج پایه پایتون
FROM python:3.11-slim

# تنظیم متغیرهای محیطی برای جلوگیری از ایجاد فایل‌های .pyc و بافر نکردن خروجی
ENV PYTHONDONTWRITEBYTECODE 1
ENV PYTHONUNBUFFERED 1

# تنظیم پوشه کاری داخل کانتینر
WORKDIR /app

# بهینه‌سازی کش لایه‌ای:
# ابتدا فقط فایل نیازمندی‌ها را کپی می‌کنیم.
COPY requirements.txt .

# سپس وابستگی‌ها را نصب می‌کنیم. این لایه فقط زمانی دوباره ساخته می‌شود
# که فایل requirements.txt تغییر کرده باشد.
RUN pip install --no-cache-dir -r requirements.txt

# در نهایت، بقیه کدهای پروژه را کپی می‌کنیم. با این کار، تغییرات در کدهای پایتون
# باعث نصب مجدد پکیج‌ها نخواهد شد.
COPY . .

# پورت اپلیکیشن را مشخص می‌کنیم
EXPOSE 8000

# اجرای سرور توسعه جنگو
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]